<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports Basecamp 3 app into Munki. Leave PLATFORM blank for Intel, set PLATFORM to "_arm64" for Arm. Set ARCHITECTURE to "x86_64" for Intel or "arm64" for Arm.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.precursorca-recipes.munki.Basecamp3</string>
	<key>Input</key>
	<dict>
		<key>PLATFORM</key>
		<string></string>
		<key>ARCHITECTURE</key>
		<string>x86_64</string>
		<key>MUNKI_CATEGORY</key>
		<string>Collaboration</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%PLATFORM%</string>
		<key>NAME</key>
		<string>Basecamp</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>We built Basecamp 3 %PLATFORM% to work beautifully on your Mac, Macbook and iMac. Keep Basecamp 3 handy in the dock and get notifications right on your desktop. </string>
			<key>developer</key>
			<string>Basecamp</string>
			<key>display_name</key>
			<string>Basecamp 3 for Mac</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
			<string>%ARCHITECTURE%</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.precursorca-recipes.download.Basecamp3</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Basecamp now recommends using a Progressive Web App and no longer has a download for a Desktop app. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
