<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Basecamp 3 Mac app. For Apple Silicon set PLATFORM to _arm64 and ARCHITECTURE to arm64; For Intel leave PLATFORM blank and set ARCHITECTURE to x86_64</string>
	<key>Identifier</key>
	<string>com.github.autopkg.precursorca-recipes.download.Basecamp3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Basecamp3</string>
		<key>PLATFORM</key>
		<string>_arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://basecamp.com/desktop/mac%PLATFORM%/updates.json</string>
                <key>re_pattern</key>
                <string>url":"([^"]+\.zip)</string>
                <key>result_output_var_name</key>
                <string>found_url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%found_url%</string>
                <key>filename</key>
                <string>BaseCamp3.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/Basecamp.app</string>
				<key>requirement</key>
				<string>identifier "com.basecamp.basecamp3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2WNYUYRS7G"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
