<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates a pkg from the Dangerzone Apple Silicon DMG.</string>
    <key>Identifier</key>
    <string>ca.precursor.pkg.Dangerzone-arm64</string>
    <key>ParentRecipe</key>
    <string>ca.precursor.download.Dangerzone-arm64</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>

    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dangerzone-arm64</string>
    </dict>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Dangerzone.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot/Applications/Dangerzone.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot</string>
                <key>pkgdir</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkgtype</key>
                <string>flat</string>
                <key>id</key>
                <string>press.freedom.dangerzone</string>
                <key>version</key>
                <string>%version%</string>
                <key>install_location</key>
                <string>/</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
